In [1]:
import pandas as pd

In [29]:
them = {'Title':['Avengers', 'Iron Man', 'Hulk', 'Scarface', 'Black Panther', 'Foreigner', 'The 100'],
                      'Rating':[9.2, 8.9, 8.5, 9.1, 8.9, 8.3, 9.2]
                      }
movies = pd.DataFrame(them)
movies

           Title  Rating
0       Avengers     9.2
1       Iron Man     8.9
2           Hulk     8.5
3       Scarface     9.1
4  Black Panther     8.9
5      Foreigner     8.3
6        The 100     9.2

In [30]:
# Setting one of the columns as the title 
movies = movies.set_index('Title')
movies

               Rating
Title
Avengers          9.2
Iron Man          8.9
Hulk              8.5
Scarface          9.1
Black Panther     8.9
Foreigner         8.3
The 100           9.2